{
  "1": {
    "title": "Problema de pesquisa",
    "text": "Como ensinar programação no primeiro ano dos ensinos médios no município de Santa Cruz do Sul de forma lúdica e interessante para os alunos?",
    "id": "problema"
  },
  "2": {
    "title": "Justificativa",
    "text": "A tecnologia vem se desenvolvendo em um ritmo alarmante, segundo o portal online da ASSEMP, no ano de 2021, o Banco Social de Tecnologia (BTEC), fundado no ano de 2019, fez a doação de 44 computadores para 10 escolas pública. A notícia em questão reforça a necessidade do nosso tempo, da nossa juventude, do uso frequente da tecnologia, não como uma forma de somente lazer, mas também como uma forma de estudo e aprendizagem. Durante a pandemia do COVID 19 isso ficou mais evidente com as aulas online, todos tivemos que nos adaptar para conseguir acompanhar esse rápido avanço da tecnologia.\n\nHavendo isso em mente, desenvolvi essa pesquisa optando pela faixa etária dos últimos anos do fundamental e os primeiros anos do ensino médio por haver um maior interesse na tecnologia e por ser um ano de transição entre o ensino fundamental e o ensino médio, dificilmente você vai encontrar alguém nessa idade que não queira ter um computador para lazer e estudo. Analisando que a área tecnológica foi a que mais se desenvolveu, pode-se ver uma grande oportunidade de pesquisar e entender como que no ensino médio sobre essas profissões que compõem o mercado de trabalho tecnológico.\n\nA grande problemática do ensino da programação nas escolas, pela minha experiência e também por relato de amigos próximos, é a falta de interesse ou dificuldade no entendimento da programação. Fato é, a programação não é um bicho de sete cabeças, então deve haver um problema no método de ensino utilizado nas escolas que possuem em sua grade curricular algum tipo de matéria relacionada à programação, visto que o desinteresse pela temática se dá pelo desentendimento e pela dificuldade dos alunos com a matéria. Pode-se concluir a ideia baseando-se na frase de GARLET.\n\nConsiderando a importância da tecnologia, o ensino da programação no meu último ano no fundamental, assim como os três anos de ensino no SENAC, mudou completamente a minha visão de vida, no sentido de que, eu estava sem um propósito, eu apenas estudava, não havia um propósito de estar fazendo tudo aquilo. Então acredito que, o estudo e investimento sobre a temática, possa mudar a vida de diversos estudantes, assim como mudou a minha para sempre. ",
    "id": "justificativa"
  },
  "3": {
    "title": "Objetivo geral da pesquisa",
    "text": "O objetivo geral dessa pesquisa é analisar, comparar e argumentar o resultado da coleta de dados das escolas que concederam a permissão de pesquisa no munícipio de Santa Cruz do Sul (SCS), assim será possível medir de forma metódica, a maneira que conteúdos relacionados à programação estão sendo ensinados aos alunos, a modo que, gere mais interesse e engajamento dos alunos com o mesmo.\n\nAlém disto, desejo também, fazer uma comparação entre as escolas que irei pesquisar, sendo elas duas que não tem como objetivo aplicar a lógica de programação em matéria alguma, nem mesmo na disciplina de informática, e outras duas que possuem o ensino da lógica de programação em pelo menos em uma das matérias.O objetivo geral dessa pesquisa é analisar, comparar e argumentar o resultado da coleta de dados das escolas que concederam a permissão de pesquisa no munícipio de Santa Cruz do Sul (SCS), assim será possível medir de forma metódica, a maneira que conteúdos relacionados à programação estão sendo ensinados aos alunos, a modo que, gere mais interesse e engajamento dos alunos com o mesmo. Além disto, desejo também, fazer uma comparação entre as escolas que irei pesquisar, sendo elas duas que não tem como objetivo aplicar a lógica de programação em matéria alguma, nem mesmo na disciplina de informática, e outras duas que possuem o ensino da lógica de programação em pelo menos em uma das matérias.",
    "id": "objetivo"
  },
  "4": {
    "title": "Objetivos específicos da pesquisa",
    "content": {
      "1": "Pesquisar sobre os métodos de ensino utilizados no munícipio de Santa Cruz do Sul.",
      "2": "Analisar a eficácia, num contexto de aprendizado e interesse dos alunos, dos métodos utilizados que foram pesquisados. ",
      "3": "Comparar os dados obtidos a partir da análise anterior.",
      "4": "Mapear os dados de cada escola pesquisada e desenvolver um website que informe sobre a pesquisa."
    },
    "id": "especificos"
  },
  "5": {
    "title": "Referencial teórico",
    "paragraph":{
      "title":{
        "1": "SURGIMENTO DA PROGRAMAÇÃO",
        "2": "MÁQUINA DE TEAR",
        "3": "A LÓGICA DE PROGRAMAÇÃO",
        "4": "MÉTODO WALDORF",
        "5": "CODE CLUB",
        "6": "STEM"
      },
      "content" :{
        "1": "SURGIMENTO DA PROGRAMAÇÃO\n\nAo início da Revolução Industrial em 1760, o homem encontrou na indústria sua dependência de produção, deixando de lado a produção racionada para a produção em massa com mão de obra barata devido às condições sanitárias e trabalhistas da época.\n\nO fato é, muitas pessoas perderam a vida devido ao trabalho em máquinas manuais, com isso, a mão de obra diminuía gradativamente à medida que as mortes aumentavam. Dito isso, precisava-se encontrar uma solução para esse problema. Em 1801, Joseph-Mariae Jacquard criou a máquina de tear, introduzindo então uma forma semiautomática e efetiva de produção em massa de tecidos.\n\nA máquina de tear funcionava por meio de um programa que deveria lhe dizer quais fios do tear poderiam passar por cima ou por baixo para que o trançado pudesse ser criado. Esses programas eram cartões perfurados que continham instruções do modelo que deveria ser produzido. (HISTÓRIA 2016)\n\nEssa máquina, além de ser revolucionária, apresentou uma nova maneira de ver a produção, não somente manual, mas também semiautomática e até mesmo automática em 1960 com o ECHO IV. ",
        "2": "A revolução que esta máquina trouxe, além de ser uma máquina semiautomática, trouxe também um campo totalmente novo, a programação algorítmica de máquinas analógicas, como a máquina de tear. Não bastava somente programar para que funcionasse, havia uma vasta explicação e lógica por trás da programação do funcionamento das máquinas de tear.\n\nCom este avanço, viu-se a necessidade de capacitar os operários que fossem utilizar as máquinas, o estudo da lógica e a capacitação da mão-de-obra se tornaram essenciais para que futuros avanços na área fossem possíveis, e até mesmo, o melhor compreendimento de processos industriais e administrativos resultou no surgimento de novos processos industriais e administrativos, que, são utilizados até nos dias de hoje. ",
        "3": "A lógica de programação é um conjunto de técnicas que permite a resolução de problemas por meio da construção de algoritmos, ou seja, uma sequência de instruções bem definidas para realizar uma tarefa específica. Essa habilidade é fundamental para a programação de computadores e também pode ser aplicada em diversas áreas do conhecimento.\n\nNo ensino médio, o ensino da lógica de programação tem ganhado destaque nos últimos anos, especialmente em disciplinas como a matemática e a informática. A relação da lógica e a matemática é quase como de mãe e filha, uma existe a partir da outra.\n\nAo aprender a lógica de programação, os estudantes desenvolvem habilidades como a resolução de problemas de forma sistemática e a organização de ideias em sequências lógicas. Além disso, essa habilidade estimula a criatividade e a capacidade de abstração, o que pode ser útil em diversas áreas do conhecimento.\n\nAo aplicar a lógica de programação em exercícios práticos, os estudantes podem desenvolver competências importantes, como a capacidade de identificar e solucionar problemas, a colaboração em equipe e a perseverança na busca por soluções, sendo essas habilidades de extrema importância no mundo do trabalho, atualmente.\n\nEm suma, a lógica de programação é uma habilidade importante que pode ser aplicada em diversas áreas do conhecimento e pode contribuir para o desenvolvimento de competências importantes para a vida pessoal e profissional dos estudantes do ensino médio. ",
        "4": "A palavra metodologia tem sua origem no latim Methodus, que significa uma maneira para realizar algo. Dentre as várias fases da história humana, sempre houve a necessidade de encontrar algum método eficaz de realizar tarefas, processos e até escolhas, isso se deve ao fato do ser humano se adaptar as adversidades que lhe são impostas. Para a educação isso não foi diferente, a educação como conhecemos hoje em dia passou por vários processos de transformação e adaptação.\n\nO conhecimento tem presença garantida em qualquer projeção que se faça sobre o futuro; contudo, os sistemas educacionais ainda não conseguiram avaliar de maneira satisfatória o impacto das tecnologias da informação sobre a Educação. Logo, será preciso trabalhar em dois tempos: o tempo do passado e o tempo do futuro. Fazendo de tudo para superar as condições de atraso e, ao mesmo tempo, criando condições para aproveitar as novas possibilidades que surgem através desses novos espaços de conhecimento. (PEREIRA, 2019) \n\nEntre os vários métodos educacionais presentes no mundo, há um que se destaca devido a sua aplicabilidade em sala de aula: o método Waldorf de ensino. Ele consiste em uma educação lúdica, interdisciplinar e que foge das normativas conservadoras de avalição por testes e conceitos.",
        "5": "O Code Club é uma iniciativa que visa promover a aprendizagem de programação e habilidades relacionadas à tecnologia da informação em crianças e jovens. Fundado em 2012, essa inciativa tem como objetivo principal criar um ambiente educacional divertido e colaborativo, onde os participantes possam desenvolver suas habilidades de programação de maneira prática e criativa.\n\nNo cerne do Code Club está a crença fundamental de que a alfabetização digital e a compreensão dos princípios de codificação são competências essenciais no mundo moderno. À medida que a sociedade avança rapidamente em direção a uma economia impulsionada pela tecnologia, capacitar jovens com conhecimentos em programação não apenas os prepara para futuras oportunidades de carreira, mas também os equipam com as habilidades necessárias para compreender e moldar ativamente o mundo digital que os rodeia.\n\nOs clubes Code Club operam em escolas, bibliotecas e comunidades locais, proporcionando um ambiente inclusivo e acessível para crianças de diversas origens. Os mentores desempenham um papel crucial nesse processo, oferecendo orientação e suporte aos participantes enquanto eles exploram conceitos fundamentais de programação, desenvolvem projetos práticos e colaboram em equipes para resolver problemas.\n\nA abordagem pedagógica do Code Club é centrada na aprendizagem baseada em projetos, onde os participantes são incentivados a criar e desenvolver projetos significativos desde o início. Essa metodologia não apenas torna o aprendizado mais envolvente, mas também permite que os alunos apliquem conceitos teóricos de maneira prática, consolidando assim seu entendimento.\n\nAo introduzir o Code Club no contexto educacional, espera-se fomentar o interesse e a participação ativa dos alunos nas disciplinas STEM (Ciência, Tecnologia, Engenharia e Matemática). Além disso, proporciona uma oportunidade valiosa para o desenvolvimento de habilidades como resolução de problemas, pensamento crítico, colaboração e criatividade, que são essenciais não apenas na programação, mas em diversas áreas da vida e do trabalho. ",
        "6": "A metodologia STEM (Science, Technology, Engineering and Mathematics), usada em suma em escolas disruptivas e escolas que se utilizam do padrão Educação 4.0, tem sua base relacionada aos problemas futuros no setor tecnológico-científico. Além, O STEM tem sua base em quatro áreas do conhecimento: \n\nCiências: Estuda a natureza e o universo, incluindo os seres vivos, a física, a química e a astronomia. \n\nTecnologia: Desenvolve e aplica novas tecnologias para resolver problemas. \n\nEngenharia: Usa os princípios da ciência e da tecnologia para criar produtos e sistemas. \n\nMatemática: Estuda os números, as formas e as relações entre eles. "
      }
    },
    "id": "referencial"
  } 
}
